//
//  VINavigationController.h
//  DIS_NAVIGATION_CONTROLLER_8_3
//
//  Created by renjinkui on 2018/7/3.
//  Copyright © 2018年 renjinkui. All rights reserved.
//

#define INHERITE 1

#import <UIKit/UIKit.h>
#import "VINavigationTransitionView.h"
#import "_VINavigationControllerPalette.h"
#import "_VINavigationParallaxTransition.h"
#import "_VIBarPanGestureRecognizer.h"
#import "_VIAnimationCoordinator.h"
#import "_VIBarTapGestureRecognizer.h"
#import "UINavigationBar+Private.h"
#import "UIView+Private.h"
#import "_VINavigationInteractiveTransition.h"
#import "DISNavigationControllerCommons.h"
#import "UIApplication+Private.h"
#import "UIViewController+Private.h"

#if INHERITE
struct VINavigationControllerFlags{
    //0x00
    int isAppearingAnimated : 1;//0
    int isAlreadyPoppingNavigationItem : 1;//1
    int isNavigationBarHidden : 1;//2
    int isToolbarShown : 1;//3
    int needsDeferredTransition : 1;//4
    int isTransitioning : 1;//5
    int paletteTransitionPending : 1;//6
    int lastOperation : 4;//7
    int lastOperationAnimated : 1;//11
    int deferredTransition : 8;//19
    int didPreloadKeyboardAnimation : 1;//20
    int didHideBottomBar : 1;//21
    int didExplicitlyHideTabBar : 1;//22
    int isChangingOrientationForPop : 1;//23
    int pretendNavBarHidden : 1;//24
    int avoidMovingNavBarOffscreenBeforeUnhiding : 1;//25
    int searchBarHidNavBar : 1;//26
    int useSystemPopoverBarAppearance : 1;//27
    int isCustomTransition : 1;//28
    int isBuiltinTransition : 1;//29
    int resetDidHideOnCancel : 1;//30
    int delegateWillShowViewController : 1;//31
    //0x04
    int delegateDidShowViewController : 1;//0
    int delegateTransitionController : 1;//1
    int delegateTransitionControllerEx : 1;//2
    int delegateInteractionController : 1;//3
    int delegateInteractionControllerEx : 1;//4
    int delegateShouldCrossFadeNavigationBar : 1;//5
    int delegateShouldCrossFadeBottomBars : 1;//6
    int delegateShouldUseBuiltinInteractionController : 1;//7
    int delegateSupportedInterfaceOrientations : 1;//8
    int delegatePreferredInterfaceOrientationForPresentation : 1;//9
    int delegateLayoutTransitioningClass : 1;//10
    int navigationBarHidesCompletelyOffscreen : 1;//11
    int clipUnderlapWhileTransitioning : 1;//12
    int isCrossfadingOutTabBar : 1;//13
    int isCrossfadingInTabBar : 1;//14
    int skipContentInsetCalculation : 1;//15
    int neverInWindow : 1;//16
    int useStandardStatusBarHeight : 1;//17
    int allowUserInteractionDuringTransition : 1;//18
    int enableBackButtonDuringTransition : 1;//19
    int allowsGroupBlending : 1;//20
    int allowNestedNavigationControllers : 1;//21
    int nestedNavigationBarWasHidden : 1;//22
    int nestedToolbarWasHidden : 1;//23
    int isNested : 1;//24
    int searchHidNavigationBar : 1;//25
    int suppressMixedOrientationPop : 1;//26
    int disappearingViewControllerIsBeingRemoved : 1;//27
    int isWrappingDuringAdaptation : 1;//28
};
typedef struct VINavigationControllerFlags VINavigationControllerFlags;

#define _containerView (GET_INSTANCE_IVAR(UIView *, _containerView))
#define _navigationBar (GET_INSTANCE_IVAR(UINavigationBar *, _navigationBar))
#define _navigationBarClass (GET_INSTANCE_IVAR(Class *, _navigationBarClass))
#define _toolbar (GET_INSTANCE_IVAR(UIToolbar *, _toolbar))
#define __backdropGroupName (GET_INSTANCE_IVAR(UIToolbar *, __backdropGroupName))
#define _navigationControllerFlags ((VINavigationControllerFlags *)ADDRESS_OF_INSTANCE_IVAR(_navigationControllerFlags))
#define _topPalette (GET_INSTANCE_IVAR(_VINavigationControllerPalette *, _topPalette))
#define __barAnimationWasCancelled (GET_INSTANCE_IVAR(BOOL, __barAnimationWasCancelled))
#define __barInteractiveAnimationCoordinator (GET_INSTANCE_IVAR(_VIAnimationCoordinator *, __barInteractiveAnimationCoordinator))
#define __barSwipeHideGesture (GET_INSTANCE_IVAR(_VIBarPanGestureRecognizer *, __barSwipeHideGesture))
#define __barTapHideGesture (GET_INSTANCE_IVAR(_VIBarTapGestureRecognizer *, __barTapHideGesture))
#define __cachedTransitionController (GET_INSTANCE_IVAR(_VINavigationParallaxTransition *, __cachedTransitionController))
#define __cachedInteractionController (GET_INSTANCE_IVAR(_VINavigationInteractiveTransition *, __cachedInteractionController))
#define _interactiveTransition (GET_INSTANCE_IVAR(BOOL, _interactiveTransition))
#define _view (GET_INSTANCE_IVAR(UIView *, _view))
//#define _builtinTransitionStyle (GET_INSTANCE_IVAR(int, _builtinTransitionStyle))

@interface VINavigationController : UINavigationController
#else
@interface VINavigationController : UIViewController
<UIGestureRecognizerDelegatePrivate, UINavigationBarDelegate>
{
    UIView *_containerView;
    UINavigationBar *_navigationBar;
    Class _navigationBarClass;
    UIToolbar *_toolbar;
    UIView *_navigationTransitionView;
    float _bottomInsetDelta;
    float _statusBarHeightForHideShow;
    UIViewController *_disappearingViewController;
    UINavigationControllerDelegate *_delegate;
    int _savedNavBarStyleBeforeSheet;
    int _savedToolBarStyleBeforeSheet;
    UITapGestureRecognizer *_backGestureRecognizer;
    _UINavigationControllerPalette *_topPalette;
    _UINavigationControllerPalette *_freePalette;
    _UINavigationControllerPalette *_transitioningTopPalette;
    struct {
        //0x00
        int isAppearingAnimated : 1;//0
        int isAlreadyPoppingNavigationItem : 1;//1
        int isNavigationBarHidden : 1;//2
        int isToolbarShown : 1;//3
        int needsDeferredTransition : 1;//4
        int isTransitioning : 1;//5
        int paletteTransitionPending : 1;//6
        int lastOperation : 4;//7
        int lastOperationAnimated : 1;//11
        int deferredTransition : 8;//19
        int didPreloadKeyboardAnimation : 1;//20
        int didHideBottomBar : 1;//21
        int didExplicitlyHideTabBar : 1;//22
        int isChangingOrientationForPop : 1;//23
        int pretendNavBarHidden : 1;//24
        int avoidMovingNavBarOffscreenBeforeUnhiding : 1;//25
        int searchBarHidNavBar : 1;//26
        int useSystemPopoverBarAppearance : 1;//27
        int isCustomTransition : 1;//28
        int isBuiltinTransition : 1;//29
        int resetDidHideOnCancel : 1;//30
        int delegateWillShowViewController : 1;//31
        //0x04
        int delegateDidShowViewController : 1;//0
        int delegateTransitionController : 1;//1
        int delegateTransitionControllerEx : 1;//2
        int delegateInteractionController : 1;//3
        int delegateInteractionControllerEx : 1;//4
        int delegateShouldCrossFadeNavigationBar : 1;//5
        int delegateShouldCrossFadeBottomBars : 1;//6
        int delegateShouldUseBuiltinInteractionController : 1;//7
        int delegateSupportedInterfaceOrientations : 1;//8
        int delegatePreferredInterfaceOrientationForPresentation : 1;//9
        int delegateLayoutTransitioningClass : 1;//10
        int navigationBarHidesCompletelyOffscreen : 1;//11
        int clipUnderlapWhileTransitioning : 1;//12
        int isCrossfadingOutTabBar : 1;//13
        int isCrossfadingInTabBar : 1;//14
        int skipContentInsetCalculation : 1;//15
        int neverInWindow : 1;//16
        int useStandardStatusBarHeight : 1;//17
        int allowUserInteractionDuringTransition : 1;//18
        int enableBackButtonDuringTransition : 1;//19
        int allowsGroupBlending : 1;//20
        int allowNestedNavigationControllers : 1;//21
        int nestedNavigationBarWasHidden : 1;//22
        int nestedToolbarWasHidden : 1;//23
        int isNested : 1;//24
        int searchHidNavigationBar : 1;//25
        int suppressMixedOrientationPop : 1;//26
        int disappearingViewControllerIsBeingRemoved : 1;//27
        int isWrappingDuringAdaptation : 1;//28
    }_navigationControllerFlags;
    char _interactiveTransition;
    char _hidesBarsWhenKeyboardAppears;
    char _hidesBarsOnSwipe;
    char _hidesBarsWhenVerticallyCompact;
    char _hidesBarsOnTap;
    char __usingBuiltinAnimator;
    char __barAnimationWasCancelled;
    Class _toolbarClass;
    float _customNavigationTransitionDuration;
    UIViewControllerAnimatedTransitioning *__transitionController;
    _UINavigationParallaxTransition *__cachedTransitionController;
    UIViewControllerInteractiveTransitioning  _UINavigationInteractiveTransition *__cachedInteractionController;
    NSUUID *__toolbarAnimationId;
    NSUUID *__navbarAnimationId;
    id __updateNavigationBarHandler;
    id __keyboardAppearedNotificationToken;
    _UIBarPanGestureRecognizer *__barSwipeHideGesture;
    _UIAnimationCoordinator *__barInteractiveAnimationCoordinator;
    _UIBarTapGestureRecognizer *__barTapHideGesture;
    int _builtinTransitionStyle;
